alexandercote/FreeRTOS_Traffic_Light_System/STM32F4_Discovery_FreeRTOS_Traffic_Light_Project/src/main.c
	}
} // end Traffic_Flow_Adjustment_Task

/*  Traffic creator task: This task generates random traffic with a rate that is
	based on the potentiometer value reading. This value is received from the traffic
	flow adjustment task. The created traffic is sent to the task that displays the flow
	of the cars on the road.
 */

void TrafficCreatorTask ( void *pvParameters )
{
	//get value from traffic flow adjustment
	uint16_t received;
	// value of bit to send to display (1 or 0)
	bool send;

	while(1)
		{
			if(xQueueReceive(xQueue_handle_speed_creator, &received, 10))
			{
				// print the received value to console
				printf("TrafficCreatorTask: The Traffic Creator Task received the value %u. \n", received );

				/* compute the value for the display (0/1)
				received should be a value 1-8
				*/
				bool TrueFalse = (rand() % 100 ) < 100/(9-received);
				//if( TrueFalse == true){
				//	send = 1;
				//}
				//else{
				//	send = 0;
				//}
				send = TrueFalse;
				// send the display value to the display queue
				if(xQueueSend(xQueue_handle_display_traffic, &send, 10)){
					printf("TrafficCreatorTask: The Traffic Creator Task is sending the value %d. \n", send);
				}
				else{
					printf("TrafficCreatorTask: error Nothing to send");
				}

			}
			else
			{
				printf("TrafficCreatorTask: Nothing in the Speed Queue");
			}
			vTaskDelay(1203);
		}
} // end Traffic_Creator_Task

/*  Traffic light task: This task controls the timing of the traffic light. This timing is
	affected by the load of the traffic which is received from the traffic flow
	adjustment task.
*/
void TrafficDisplayTask ( void *pvParameters )
{
	//get value from traffic creator
	bool received;


	while(1)
		{
			if(xQueueReceive(xQueue_handle_display_traffic, &received, 10))
			{
				// print the received value to console
				printf("TrafficDisplayTask: The Traffic Display Task received the value %u. \n", received );
				ShiftRegisterValuePreLight(received);
				vTaskDelay(500);
				// print the display value (0/1)
			}
		}


} // end Traffic_Display_Task




static void vGreenLightTimerCallback( xTimerHandle xTimer )
{
	// green light time is up, change the light to red
	// set some flag or something for the display controller
	GPIO_ResetBits(TRAFFIC_LIGHT_PORT, TRAFFIC_LIGHT_GREEN_PIN);        // turn off green light
	GPIO_SetBits(TRAFFIC_LIGHT_PORT, TRAFFIC_LIGHT_YELLOW_PIN);         // turn on yellow light
	vTaskDelay(2000);
	GPIO_ResetBits(TRAFFIC_LIGHT_PORT, TRAFFIC_LIGHT_YELLOW_PIN);       // turn off yellow light
	GPIO_SetBits(TRAFFIC_LIGHT_PORT, TRAFFIC_LIGHT_RED_PIN);            // turn on red light
	xTimerStart( xRedLightSoftwareTimer, 0 );
}
static void vRedLightTimerCallback( xTimerHandle xTimer )
{
	GPIO_ResetBits(TRAFFIC_LIGHT_PORT, TRAFFIC_LIGHT_RED_PIN);        // turn off red light
	GPIO_SetBits(TRAFFIC_LIGHT_PORT, TRAFFIC_LIGHT_GREEN_PIN);        // turn on green light
	xTimerStart( xGreenLightSoftwareTimer, 0 );
}

/*  Traffic light task: This task controls the timing of the traffic light. This timing is
	affected by the load of the traffic which is received from the traffic flow
	adjustment task.
*/
void TrafficLightTask ( void *pvParameters )
{
	// get speed
	// given speed, change timing

	//get value from traffic flow adjustment
	uint16_t speed_value;

	while(1)
		{
			if(xQueueReceive(xQueue_handle_speed_light, &speed_value, 10))
			{
				// print the received value to console
				printf("TrafficCreatorTask: The Traffic Light Task received the value %u. \n", speed_value );

				if(xTimerIsTimerActive( xRedLightSoftwareTimer )){
					xTimerStop(xRedLightSoftwareTimer, 0);
				}
				if(xTimerIsTimerActive( xGreenLightSoftwareTimer )){
					xTimerStop(xGreenLightSoftwareTimer, 0);
				}

				xTimerChangePeriod(xGreenLightSoftwareTimer, (5000 + 2000 * (9-speed_value))  / portTICK_PERIOD_MS, 0 );
				xTimerChangePeriod(xRedLightSoftwareTimer, (3000 + 500 * (9-speed_value)) / portTICK_PERIOD_MS, 0 );

			}
			vTaskDelay(1203);
		}
} // end Traffic_Light_Task

/*
    Traffic display task: This task controls the LEDs that represent the cars at the
	intersection. It receives the traffic from traffic creator task and displays them on
	the LEDs. It refreshes the LEDs at a certain interval to emulate the flow of the
	traffic.
 */



void ShiftRegisterValuePreLight( bool value )
{
	printf("Shifting prelight register.\n");
	GPIO_ResetBits(SHIFT_REG_1_PORT, SHIFT_REG_CLK_1_PIN);      // ensure shift register clock is low
	if (value == false)                                             // no car present
		GPIO_ResetBits(SHIFT_REG_1_PORT, SHIFT_REG_1_PIN);	    // set output low
	else                                                        // car on the road at this location
		GPIO_SetBits(SHIFT_REG_1_PORT, SHIFT_REG_1_PIN);        // set output high
	GPIO_SetBits(SHIFT_REG_1_PORT, SHIFT_REG_CLK_1_PIN);        // set clock high
	//vTaskDelay(50);
	GPIO_ResetBits(SHIFT_REG_1_PORT, SHIFT_REG_CLK_1_PIN);      // set clock low again
}

void ShiftRegisterValuePostLight( bool value )
{
	GPIO_ResetBits(SHIFT_REG_2_PORT, SHIFT_REG_CLK_2_PIN);      // ensure shift register clock is low
	if (value == false)                                             // no car present
		GPIO_ResetBits(SHIFT_REG_2_PORT, SHIFT_REG_2_PIN);	    // set output low
	else                                                        // car on the road at this location
		GPIO_SetBits(SHIFT_REG_2_PORT, SHIFT_REG_2_PIN);        // set output high
	GPIO_SetBits(SHIFT_REG_2_PORT, SHIFT_REG_CLK_2_PIN);        // set clock high
	//vTaskDelay(50);
	GPIO_ResetBits(SHIFT_REG_2_PORT, SHIFT_REG_CLK_2_PIN);      // set clock low again
}

void ShiftTestTask ( void* pvParameters )
{
	while(1)
	{
		printf("ShiftTestTop!\n");
		ShiftRegisterValuePreLight( true );
		vTaskDelay(500);
		ShiftRegisterValuePreLight( true );
		vTaskDelay(500);
		ShiftRegisterValuePreLight( true );
		vTaskDelay(500);
		ShiftRegisterValuePreLight( true );
		vTaskDelay(500);
		ShiftRegisterValuePreLight( true );
		vTaskDelay(500);
		ShiftRegisterValuePreLight( true );
		vTaskDelay(500);
		ShiftRegisterValuePreLight( true );
		vTaskDelay(500);
		ShiftRegisterValuePreLight( false );
		vTaskDelay(500);
		ShiftRegisterValuePreLight( false );
		vTaskDelay(500);
	}
} // end ShiftTestTask



void ADCTestTask( void* pvParameters)
{
	uint16_t adc_value;
	while(1)
	{
		ADC_SoftwareStartConv(ADC1);
		// wait for ADC to finish conversion
		while(!ADC_GetFlagStatus(ADC1, ADC_FLAG_EOC));
		// grab ADC value
		adc_value = ADC_GetConversionValue(ADC1);
		printf("ADC Value: %d\n", adc_value);
		vTaskDelay(500);
	}
} // end ADCTestTask

